2-rails/appname/app/views/posts/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :category_id, style: "display: block" %>
    <%= form.select :category_id, Category.all.collect{ |c| [c.title, c.id]} %>