2-rails/appname/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "summary", "body", "active", "created_at", "updated_at") VALUES ('se', 'sdf', 'sdf', TRUE, '2025-07-09 09:42:58.122652', '2025-07-09 09:42:58.122652') RETURNING "id"

    def set_post
      @post = Post.find(params.expect(:id))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1