2-rails/appname/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
---
  def set_post
    # Corrected: Use params[:id] to access the ID from the URL.
    @post = Post.find(params[:id])